---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepJoined
source: html/3a7df23f-f396-b7f7-5a14-28ebde0d42b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepJoined Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepJoined { get; }
```